raddit/app/controllers/links_controller.rb

  def index
    @links = Link.all
---
SELECT "links".* FROM "links"

  def create
    @link = current_user.links.build(link_params)

    respond_to do |format|
      if @link.save
---
INSERT INTO "links" ("title", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "CSS-Tricks"], ["url", "http://css-tricks.com"], ["user_id", 1], ["created_at", "2016-02-12 08:17:54.528048"], ["updated_at", "2016-02-12 08:17:54.528048"]]

  def destroy
    @link.destroy
---
DELETE FROM "links" WHERE "links"."id" = ?  [["id", 1]]

def upvote
  @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 2]]

def downvote
  @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 2]]

    def set_link
      @link = Link.find(params[:id])
---
SELECT  "links".* FROM "links" WHERE "links"."id" = ? LIMIT 1  [["id", 1]]